; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v8 - type_1 ?v7 - type_3)
 	      (pred_2 ?v1 - object ?v7 - type_3)
	      (pred_1 ?v8 - type_1 ?v3 - type_2)
	      (pred_3 ?v8 - type_1 ?v1 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v8 - type_1 ?v6 ?v2 - type_3)
       :precondition (and  (pred_4 ?v8 ?v6))
       :effect (and  (pred_4 ?v8 ?v2)
		     (not (pred_4 ?v8 ?v6))))

   (:action op_1
       :parameters (?v8 - type_1 ?v5 - object ?v4 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v4) (pred_4 ?v8 ?v4) (pred_1 ?v8 ?v3))
       :effect (and (pred_3 ?v8 ?v5 ?v3)
		    (not (pred_2 ?v5 ?v4)) 
		    (not (pred_1 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_1 ?v5 - object ?v4 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v5 ?v3) (pred_4 ?v8 ?v4))
       :effect (and (pred_2 ?v5 ?v4)
		    (pred_1 ?v8 ?v3)
		    (not (pred_3 ?v8 ?v5 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_06 - type_1
obj_12 obj_01 obj_04 obj_08 - type_2
obj_02 obj_09 obj_10 - type_3
obj_07 obj_11 obj_05 - object)
(:init
(pred_4 obj_03 obj_02)
(pred_1 obj_03 obj_12)
(pred_1 obj_03 obj_01)
(pred_4 obj_06 obj_02)
(pred_1 obj_06 obj_04)
(pred_1 obj_06 obj_08)
(pred_2 obj_07 obj_09)
(pred_2 obj_11 obj_02)
(pred_2 obj_05 obj_10)
)
(:goal
(and
(pred_2 obj_07 obj_02)
(pred_2 obj_11 obj_02)
(pred_2 obj_05 obj_09)
)
)

(:constraints
  (always (not (pred_4 obj_03 obj_10)))
)
)

; plan
1. (op_2 obj_03 obj_02 obj_09)
   deleted: (pred_4 obj_03 obj_02)
   added: (pred_4 obj_03 obj_09)
   goals met: 1 of 3
2. (op_2 obj_06 obj_02 obj_10)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_10)
   goals met: 1 of 3
3. (op_1 obj_06 obj_05 obj_10 obj_08)
   deleted: (pred_2 obj_05 obj_10) (pred_1 obj_06 obj_08)
   added: (pred_3 obj_06 obj_05 obj_08)
   goals met: 1 of 3
4. (op_1 obj_03 obj_07 obj_09 obj_01)
   deleted: (pred_2 obj_07 obj_09) (pred_1 obj_03 obj_01)
   added: (pred_3 obj_03 obj_07 obj_01)
   goals met: 1 of 3
5. (op_2 obj_06 obj_10 obj_09)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_09)
   goals met: 1 of 3
6. (op_2 obj_03 obj_09 obj_02)
   deleted: (pred_4 obj_03 obj_09)
   added: (pred_4 obj_03 obj_02)
   goals met: 1 of 3
7. (op_3 obj_06 obj_05 obj_09 obj_08)
   deleted: (pred_3 obj_06 obj_05 obj_08)
   added: (pred_2 obj_05 obj_09) (pred_1 obj_06 obj_08)
   goals met: 2 of 3
8. (op_3 obj_03 obj_07 obj_02 obj_01)
   deleted: (pred_3 obj_03 obj_07 obj_01)
   added: (pred_2 obj_07 obj_02) (pred_1 obj_03 obj_01)
   goals met: 3 of 3
